; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	image1 - mode
	thermograph0 - mode
	infrared4 - mode
	infrared2 - mode
	image3 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	Planet3 - direction
	Star4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 infrared4)
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image1)
	(supports instrument1 infrared4)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument2 image1)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared4)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet12)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 image3)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star10)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 thermograph0)
	(supports instrument8 image3)
	(calibration_target instrument8 Star2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(supports instrument9 infrared2)
	(supports instrument9 infrared4)
	(supports instrument9 image3)
	(calibration_target instrument9 GroundStation1)
	(supports instrument10 image3)
	(calibration_target instrument10 Star2)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star2)
)
(:goal (and
	(pointing satellite1 GroundStation0)
	(pointing satellite3 GroundStation1)
	(have_image Planet3 thermograph0)
	(have_image Star4 thermograph0)
	(have_image Phenomenon5 infrared2)
	(have_image Phenomenon6 infrared4)
	(have_image Star7 infrared2)
	(have_image Phenomenon8 infrared4)
	(have_image Phenomenon9 thermograph0)
	(have_image Star10 infrared2)
	(have_image Planet12 image1)
	(have_image Planet14 image1)
	(have_image Star15 infrared4)
	(have_image Planet17 infrared4)
))

)

; plan
1. (switch_on instrument9 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument9)
   goals met: 1 of 14
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 1 of 14
3. (calibrate satellite3 instrument7 groundstation1)
   added: (calibrated instrument7)
   goals met: 1 of 14
4. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 1 of 14
5. (turn_to satellite4 groundstation1 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 groundstation1)
   goals met: 1 of 14
6. (calibrate satellite4 instrument9 groundstation1)
   added: (calibrated instrument9)
   goals met: 1 of 14
7. (turn_to satellite4 phenomenon5 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 phenomenon5)
   goals met: 1 of 14
8. (take_image satellite4 phenomenon5 instrument9 infrared2)
   added: (have_image phenomenon5 infrared2)
   goals met: 2 of 14
9. (turn_to satellite4 phenomenon6 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 phenomenon6)
   goals met: 2 of 14
10. (take_image satellite4 phenomenon6 instrument9 infrared4)
   added: (have_image phenomenon6 infrared4)
   goals met: 3 of 14
11. (turn_to satellite4 phenomenon8 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 phenomenon8)
   goals met: 3 of 14
12. (take_image satellite4 phenomenon8 instrument9 infrared4)
   added: (have_image phenomenon8 infrared4)
   goals met: 4 of 14
13. (turn_to satellite4 planet17 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 planet17)
   goals met: 4 of 14
14. (take_image satellite4 planet17 instrument9 infrared4)
   added: (have_image planet17 infrared4)
   goals met: 5 of 14
15. (turn_to satellite4 star10 planet17)
   deleted: (pointing satellite4 planet17)
   added: (pointing satellite4 star10)
   goals met: 5 of 14
16. (take_image satellite4 star10 instrument9 infrared2)
   added: (have_image star10 infrared2)
   goals met: 6 of 14
17. (turn_to satellite4 star15 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 star15)
   goals met: 6 of 14
18. (take_image satellite4 star15 instrument9 infrared4)
   added: (have_image star15 infrared4)
   goals met: 7 of 14
19. (turn_to satellite4 star7 star15)
   deleted: (pointing satellite4 star15)
   added: (pointing satellite4 star7)
   goals met: 7 of 14
20. (take_image satellite4 star7 instrument9 infrared2)
   added: (have_image star7 infrared2)
   goals met: 8 of 14
21. (turn_to satellite1 groundstation0 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 groundstation0)
   goals met: 9 of 14
22. (calibrate satellite1 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 9 of 14
23. (turn_to satellite3 phenomenon9 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 phenomenon9)
   goals met: 8 of 14
24. (take_image satellite3 phenomenon9 instrument7 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 9 of 14
25. (turn_to satellite3 groundstation1 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 groundstation1)
   goals met: 10 of 14
26. (turn_to satellite3 planet3 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 planet3)
   goals met: 9 of 14
27. (take_image satellite3 planet3 instrument7 thermograph0)
   added: (have_image planet3 thermograph0)
   goals met: 10 of 14
28. (turn_to satellite3 groundstation1 planet3)
   deleted: (pointing satellite3 planet3)
   added: (pointing satellite3 groundstation1)
   goals met: 11 of 14
29. (turn_to satellite3 star4 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 star4)
   goals met: 10 of 14
30. (take_image satellite3 star4 instrument7 thermograph0)
   added: (have_image star4 thermograph0)
   goals met: 11 of 14
31. (turn_to satellite3 groundstation1 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 groundstation1)
   goals met: 12 of 14
32. (turn_to satellite1 planet12 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet12)
   goals met: 11 of 14
33. (take_image satellite1 planet12 instrument4 image1)
   added: (have_image planet12 image1)
   goals met: 12 of 14
34. (turn_to satellite1 groundstation0 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 groundstation0)
   goals met: 13 of 14
35. (turn_to satellite1 planet14 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet14)
   goals met: 12 of 14
36. (take_image satellite1 planet14 instrument4 image1)
   added: (have_image planet14 image1)
   goals met: 13 of 14
37. (turn_to satellite1 groundstation0 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 groundstation0)
   goals met: 14 of 14
